---
kind: enumMember
id: F:Autodesk.Revit.DB.BuildingType.kHotel
enum: Autodesk.Revit.DB.BuildingType
source: html/4c72befb-2ad7-b4e8-3160-0845d4cf47b0.htm
---
# Autodesk.Revit.DB.BuildingType.kHotel

Building Type is Hotel.